<?= $this->extend("layout/login-layout"); ?>
<!-- DataTables -->

<?= $this->section("content"); ?>
<div class="class_header_page_02">
    <br />
    <font style="font-size: 25px;"><b>หน้ารวมเมนู</b></font>
    <hr />
</div>
<div class="class_header_page_02">
    <font style="font-size: 18px;"><b>คำขอใช้ที่ดิน</b></font><br />
    <a href="ieat_ent_011">คำขอใช้ที่ดินเพื่อประกอบกิจการในนิคมอุตสาหกรรม (กนอ.01/1)</a><br />
    <a href="ieat_ent_011_1">คำขอใช้ที่ดินเพื่อประกอบกิจการในนิคมอุตสาหกรรม (กนอ.01/1) (ยื่นที่ดินเพิ่มเติม)</a><br />
    <a href="ieat_ent_013">คำขอทั่วไป (กนอ. 01/3)</a><br />
    <a href="ieat_ent_013_1">คำขอทั่วไป (กนอ. 01/3)(โอนสิทธิ)</a><br />
    <a href="ieat_ent_013_2">คำขอทั่วไป (กนอ. 01/3)(การคืนสิทธิใช้ที่ดิน)</a><br />
    <a href="ieat_ent_013_3">คำขอทั่วไป (กนอ. 01/3)(การรับคืนสิทธิการใช้ที่ดิน)</a><br />
    <a href="ieat_ent_013_4">คำขอทั่วไป (กนอ. 01/3)(เปลี่ยนแปลงสิทธิในที่ดิน)</a><br />
    <a href="ieat_ent_013_10">คำขอทั่วไป (กนอ.01/3)(ควบรวมกิจการ)</a><br />
    <a href="ieat_ent_013_9">คำขอทั่วไป (กนอ. 01/3) การเลิก/หยุดประกอบกิจการ</a><br />
    <a href="ieat_ent_013_p1">คำขอทั่วไป (กนอ. 01/3) แก้ไขข้อความการประกอบกิจการ</a><br />
    <a href="ieat_ent_013_p2">คำขอทั่วไป (กนอ. 01/3) เพิ่มหรือเปลี่ยนแปลงประเภทการประกอบกิจการ</a><br />

    <hr />
    <font style="font-size: 18px;"><b>คำขอก่อสร้าง</b></font><br />
    <a href="ieat_ent_021">การขออนุญาตก่อสร้าง ดัดแปลง รื้อถอน หรือเคลื่อนย้ายอาคาร (ข.1)</a><br />
    <a href="ieat_ent_028">การขออนุญาตเปลี่ยนการใช้อาคาร (ข.2)</a><br />
    <a href="ieat_ent_0211">การขออนุญาตดัดแปลงหรือใช้ที่จอดรถ ที่กลับรถ และทางเข้าออกของรถเพื่อการอื่น (ข.3)</a><br />
    <a href="ieat_ent_026">การขอต่ออายุใบอนุญาตก่อสร้าง ดัดแปลง รื้อถอน หรือเคลื่อนย้ายอาคาร (ข.4)</a><br />
    <a href="ieat_ent_029">การขออนุญาตแก้ไขเปลี่ยนแปลงแผนผังบริเวณ แบบแปลน และรายการประกอบแบบแปลน ให้ผิดไปจากที่ได้รับอนุญาต (ข.6)</a><br />
    <a href="ieat_ent_0210">การขอโอนใบอนุญาตก่อสร้าง ดัดแปลง รื้อถอน เคลื่อนย้าย หรือเปลี่ยนการใช้อาคาร (ข.7)</a><br />
    <a href="ieat_ent_022">การขอหนังสือแจ้งการก่อสร้าง ดัดแปลง หรือ รื้อถอนอาคาร โดยไม่ยื่นคําขอรับใบอนญาตจากเจ้าพนักงานท้องถิ่น ตามมาตรา 39 ทวิ (ยผ.1)</a><br />
    <a href="ieat_ent_023">การขอใบรับรองการก่อสร้าง การดัดแปลง หรือการเคลื่อนย้ายอาคารประเภทควบคุมการใช้ (ขร.1)</a><br />
    <a href="ieat_ent_024">การขอใบรับรองการตรวจสอบอาคารตามมาตรา 32 ทวิ (ขร.2)</a><br />
    <a href="ieat_ent_027">การขอเปลี่ยนตัวผู้ควบคุมงาน</a><br />
    <a href="ieat_ent_0212">ขอทำการเจาะกด หรือตอกเสาเข็มเพื่อทำการทดสอบที่จะใช้ในการก่อสร้างอาคาร</a><br />
    <a href="ieat_ent_0213">ขออนุญาตตัดคันหินทางเท้า และทำทางเชื่อมกับถนนภายในนิคมอุตสาหกรรม</a><br />
    <a href="ieat_ent_0214">ขออนุญาตติดตั้งปั้นจั่นหอสูง (Tower Crane)</a><br />

    <hr />
    <font style="font-size: 18px;"><b>คำขอขุดดิน ถมดิน</b></font><br />
    <a href="ieat_ent_025">คำขอขุดดิน ถมดิน</a>

    <hr />
    <font style="font-size: 18px;"><b>คำขอการประกอบกิจการในนิคม</b></font><br />
    <a href="ieat_ent_031">คําขอแจ้งเริ่มประกอบอุตสาหกรรม(กนอ. 03/1)</a><br />
    <a href="ieat_ent_032">คำขออนุญาตประกอบอุตสาหกรรมส่วนขยาย (กนอ. 03/3)</a><br />
    <a href="ieat_ent_034">คําขอแจ้งเริ่มประกอบอุตสาหกรรม(กนอ. 03/1) ส่วนขยาย</a><br />
    <a href="ieat_ent_035">คำขอขยายระยะเวลาการแจ้งเริ่มประกอบกิจการ</a><br />
    <a href="ieat_ent_036">คำขอแจ้งการทดลองเดินเครื่องจักร</a><br />

    <hr />
    <font style="font-size: 18px;"><b>คำขอ TAX</b></font><br />
    <a href="ieat_ent_041">ยื่นคำขอใบรับรองเป็นผู้ประกอบการในเขตประกอบการเสรี (คำขอนำเข้าวัตถุดิบ) IEAT-I-01</a><br />
    <a href="ieat_ent_042">ยื่นคำขออนุมัติใบรับรองขอยกเว้นมาตรฐาน (นำของเข้าโดยมีวัตถุประสงค์เพื่อส่งออก) IEAT-I-03</a><br />
    <a href="ieat_ent_043">ยื่นคำขอยกเว้นหรือคืนค่าภาษีอากร สำหรับเครื่องจักร วัตถุดิบ นำเข้าจากต่างประเทศ IEAT-I-05</a><br />
    <a href="ieat_ent_044">ยื่นคำขอยกเว้นหรือคืนค่าภาษีอากร สำหรับเครื่องจักร วัตถุดิบ นำเข้าจากในประเทศ IEAT-I-06</a><br />
    <a href="ieat_ent_045">ยื่นคำขออนุญาตนำของออกไปจากเขตประกอบการเสรี (นำของออก) IEAT-E-01</a><br />
    <a href="ieat_ent_taxincentive">โปรแกรมยื่นคำขอรับรองการเป็นผู้ประกอบการในเขตประกอบการเสรี และขอเลขทะเบียนสิทธิประโยชน์ทางด้านภาษีอากร (TAX Incentive)</a><br />
    <a href="ieat_ent_canceltaxincentive">โปรแกรมยกเลิก TAX Incentive</a><br />
    <a href="ieat_ent_04021">คำขออนุมัติให้นำของเข้ามาในราชอาณาจักรและนำเข้าไปในเขตประกอบการเสรี ให้ได้รับยกเว้นกฎหมายควบคุมฯ ตามมาตรา 49 (IEAT-I-03-1)</a><br />
    <a href="ieat_ent_04051">คำขออนุมัติให้นำของหรือผลิตภัณฑ์ออกจากเขตประกอบการเสรี ให้ได้รับยกเว้นกฎหมายควบคุมฯ ตามมาตรา 49 (IEAT-E-03)</a><br />
    <a href="ieat_ent_046">คำขอยกเลิกสิทธิประโยชน์ด้านภาษีอากร</a><br />
    <a href="ieat_ent_t01_009">จัดการข้อมูลผู้นำเข้า ส่งออก (นำเข้า - ส่งออกโดยรายอื่น)</a><br />
    <a href="ieat_ent_r01_003">จัดทำรายงานการนำของเข้า ตามใบอนุญาตนำของเข้าตามช่วงเวลา (IEAT-I-02-R)</a><br />
    <a href="ieat_ent_r01_005">จัดทำรายงานการนำของเข้า ตามใบอนุญาตนำของเข้า จากต่างประเทศรายครั้ง (IEAT-I-05-R)</a><br />
    <a href="ieat_ent_r01_005_1">จัดทำรายงานการนำของเข้า ตามใบอนุญาตนำของเข้า จากภายในประเทศรายครั้ง (IEAT-I-06-R)</a><br />
    <a href="ieat_ent_r01_003_out">จัดทำรายงานการนำของออกประเภทตามช่วงเวลา (IEAT-E-02-R-01)</a><br />
    <a href="ieat_ent_r01_005_out">จัดทำรายงานการนำของออก ประเภทรายครั้ง (IEAT-E-02-R-02)</a><br />
    <a href="ieat_ent_r01_005_1_out">จัดทำรายงานการนำของออก วัตถุประสงค์ เพื่อการอื่นเป็นการชั่วคราวและการนำกลับ (IEAT-E-02-R-03)</a><br />

    <hr />
    <font style="font-size: 18px;"><b>คำขอ NON-TAX</b></font><br />
    <a href="ieat_ent_05_0001">โปรแกรมปรับปรุงฐานข้อมูล ช่าง และครอบครัว ให้เป็นปัจจุบัน</a><br />
    <a href="ieat_ent_05_005">คำขออนุญาตถือกรรมสิทธิ์ที่ดินในนิคมฯ (15ส. นิติบุคคลต่างด้าว)*มีค่าใช้จ่าย</a><br />
    <a href="ieat_ent_05_005_1">คำขออนุญาตถือกรรมสิทธิ์ที่ดินในนิคมฯ (เปลี่ยนแปลงสัดส่วนผู้ถือหุ้น)*มีค่าใช้จ่าย</a><br />
    <a href="ieat_ent_05_006">คำขออนุญาตถือกรรมสิทธิ์ที่ดินเขตที่พักอาศัยและพาณิชยกรรม (15.1 ส. นิติบุคคลต่างด้าว)</a><br />
    <a href="ieat_ent_05_007">คำขออนุญาตถือกรรมสิทธิ์ที่ดินในนิคมอุตสาหกรรม ของนิติบุคคลไทย/บุคคลธรรมดา (15.2 ส)</a><br />
    <a href="ieat_ent_05_001_p3">แจ้งผลโอนกรรมสิทธิ์</a><br />
    <a href="ieat_ent_051">คำขออนุญาตบรรจุ ช่างฝีมือ ผู้ชำนาญการ เข้ามาทำงานในนิคมฯและครอบครัวเข้ามาอยู่ในราชอาณาจักรไทย (17-1 และ 17-2)*มีค่าใช้จ่าย</a><br />
    <a href="ieat_ent_051_p2">คำขออนุญาตต่ออายุ ช่างฝีมือ ผู้ชำนาญการ เข้ามาทำงานในนิคมฯและครอบครัวเข้ามาอยู่ในราชอาณาจักรไทย (17-1 และ 17-2)*มีค่าใช้จ่าย</a><br />
    <a href="ieat_ent_053">คำขอทั่วไป 17-3 (ขอแจ้งช่างฝีมือ ผู้ชำนาญการพ้นจากตำแหน่งและครอบครัว)</a><br />
    <a href="ieat_ent_053_1">คำขอทั่วไป 17-3 (ขอแจ้งยกเลิกสิทธิการอยู่ในราชอาณาจักรของครอบครัว)</a><br />
    <a href="ieat_ent_053_2">คำขอทั่วไป 17-3 (การเปลี่ยนตำแหน่งของช่างฝีมือ ผู้ชำนาญการ)</a><br />
    <a href="ieat_ent_053_3">คำขอทั่วไป 17-3 (การขอเพิ่มตำแหน่งให้ช่างฝีมือ ผู้ชำนาญการ)</a><br />
    <a href="ieat_ent_053_4">คำขอทั่วไป 17-3 (การขอเพิ่ม *ตำแหน่งกรรมการ *ให้ช่างฝีมือ ผู้ชำนาญการ)</a><br />
    <a href="ieat_ent_053_5">คำขอรับการตรวจลงตราประเภทคนอยู่ชั่วคราว</a><br />
    <a href="ieat_ent_053_6">คำขอเปลี่ยนชื่อนิติบุคคลประเภทบริษัทจำกัด</a><br />
    <a href="ieat_ent_053_7">คำขอเปลี่ยนที่ตั้งสถานประกอบการ</a><br />
    <a href="ieat_ent_053_9">คำขอทั่วไป 17-3 (ขออนุญาตให้นำช่างฝีมือ ผู้ชำนาญการ คู่สมรสและบุคคลซึ่งอยู่ในอุปการะ อยู่ในราชอาณาจักรตามสิทธิเดิมที่ได้รับอนุญาตไว้เดิม ( กรณีไม่ได้ทำ RE-ENTRY VISA ))</a><br />
    <a href="ieat_ent_05_changename">คำขอการเปลี่ยนแปลงคำนำหน้าชื่อ ชื่อ สกุล ของช่างฝีมือ ผู้ชำนาญการและครอบครัว</a><br />
    <a href="ieat_ent_05_cancel_nontax">คำขอยกเลิกสิทธิประโยชน์ที่ไม่เกี่ยวกับภาษีอากร</a><br />

    <hr />
    <font style="font-size: 18px;"><b>คำขอ สาธารณสุข</b></font><br />
    <a href="ieat_ent_077">คำขอประกอบกิจการที่เป็นอันตรายต่อสุขภาพ</a><br />
    <a href="ieat_ent_079">คำขอจัดตั้งสถานที่จำหน่ายอาหารและสถานที่สะสมอาหาร พื้นที่เกิน 200 ตรม.</a><br />
    <a href="ieat_ent_0710">คำขอจัดตั้งสถานที่จำหน่ายอาหารและสถานที่สะสมอาหาร พื้นที่ไม่เกิน 200 ตรม.</a><br />

    <hr />
    <font style="font-size: 18px;"><b>โปรแกรมอื่นๆ</b></font><br />
    <a href="ieat_ent_021">จัดการข้อมูลผู้ติดต่อ</a><br />
    <a href="ieat_ent_021">จัดการข้อมูลที่อยู่สำหรับออกใบกำกับภาษี</a><br />
    <a href="ieat_ent_021">โปรแกรมยื่นคำขอรับรองการเป็นผู้ประกอบการส่งออกที่ดี</a><br />
    <a href="ieat_ent_021">ขอรับสิทธิประโยชน์ Eco</a><br />
    <a href="ieat_ent_021">โปรแกรมออกใบแจ้งรับชำระเงินล่วงหน้า</a><br />

    <hr />
    <font style="font-size: 18px;"><b>ตรวจประเมินรับรองตัวเอง</b></font><br />
    <a href="ieat_ent_selfdecare">ตรวจประเมินรับรองตัวเอง</a><br />

    <hr />
    <font style="font-size: 18px;"><b>รายงาน</b></font><br />
    <a href="ieat_ent_r01_001">รายงานค่าใช้จ่ายในการยื่นคำขอสิทธิประโยชน์ทางด้านภาษีอากร</a><br />
    <a href="ieat_ent_r01_002">รายงานข้อมูลประวัติการเติมเงินในระบบใหม่</a><br />
</div>



<!-- DataTables -->
<script src="plugins/datatables/jquery.dataTables.js"></script>
<script src="plugins/datatables-bs4/js/dataTables.bootstrap4.js"></script>
<?= $this->endSection(); ?>

<?= $this->section("javascripts"); ?>
<script>
    $(document).ready(function() {
        // console.log("Document ready page Search");
        var tableDt = $('#tbSearch').DataTable({
            "paging": false,
            "destroy": true,
            "searching": false,
            "ordering": false,
            "processing": false,
            "serverSide": false,
            // "columns": colDt,
            "autoWidth": false,
            "order": [
                [0, 'asc']
            ],
            "responsive": true,
            "lengthChange": false,
            "bInfo": false,
            "bLengthMenu": false, // Hide page lengthMenu
        });
    });

    /*
    $('[name=data_search2]').daterangepicker({
        "singleDatePicker": true,
        "timePicker": false,
        "timePicker24Hour": true,
        "timePickerIncrement": 10,
        "autoApply": true,
        StartDate: moment().format("YYYY-MM-DD"),
        locale: {
            format: 'YYYY-MM-DD'
        }
    });
    */
    $(window).on("load", function() {
        // console.log("window load page Search");
    });
</script>
<?= $this->endSection(); ?>